In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
conn_string = 'mysql://root:rohan5455@localhost:3306/music_store'
db = create_engine(conn_string)
conn = db.connect()

In [4]:
files = ['album','album2','artist','customer','employee','genre','invoice','invoice_line','media_type','playlist','playlist_track','track']
for file in files:
        df = pd.read_csv(f"C:\\Users\\ROHAN VERMA R11\\Desktop\\music store data\\{file}.csv")
        df.to_sql(file,con=conn,if_exists='replace',index=False)

In [5]:
df1 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\album.csv")
df1.head()

   album_id                                              title  artist_id
0       156                                And Justice For All         50
1       208                               Black Light Syndrome        136
2       257  20th Century Masters - The Millennium Collecti...        179
3       296                      A Copland Celebration, Vol. I        230
4        94                         A Matter of Life and Death         90

In [6]:
df1.shape

(347, 3)

In [7]:
df1.describe()

         album_id   artist_id
count  347.000000  347.000000
mean   174.000000  121.942363
std    100.314505   77.793131
min      1.000000    1.000000
25%     87.500000   58.000000
50%    174.000000  112.000000
75%    260.500000  179.500000
max    347.000000  275.000000

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347 entries, 0 to 346
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   album_id   347 non-null    int64
 1   title      347 non-null    object
 2   artist_id  347 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.3+ KB

In [9]:
df1.columns

Index(['album_id', 'title', 'artist_id'], dtype='object')

In [10]:
df1.dtypes

album_id      int64
title        object
artist_id     int64
dtype: object

In [11]:
#check for null values
print(df1.isnull().sum())

album_id     0
title        0
artist_id    0
dtype: int64

In [84]:
#check for duplicate values
print(df1.duplicated().sum())

0

In [12]:
df2 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\album2.csv")
df2.head()

   album_id                                  title  artist_id
0         1  For Those About To Rock We Salute You          1
1         2                      Balls to the Wall          2
2         3                      Restless and Wild          2
3         4                      Let There Be Rock          1
4         5                               Big Ones          3

In [13]:
df2.shape

(347, 3)

In [14]:
df2.describe()

         album_id   artist_id
count  347.000000  347.000000
mean   174.000000  121.942363
std    100.314505   77.793131
min      1.000000    1.000000
25%     87.500000   58.000000
50%    174.000000  112.000000
75%    260.500000  179.500000
max    347.000000  275.000000

In [15]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347 entries, 0 to 346
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   album_id   347 non-null    int64
 1   title      347 non-null    object
 2   artist_id  347 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.3+ KB

In [16]:
df2.columns

Index(['album_id', 'title', 'artist_id'], dtype='object')

In [126]:
df2['album_id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208,
       209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221,
       222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234,
       235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247,
       248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260,
       261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273,
       274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286,
       287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299,
       300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312,
       313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325,
       326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338,
       339, 340, 341, 342, 343, 344, 345, 346, 347], dtype=int64)

In [115]:
df2['artist_id'].unique

<bound method Series.unique of 0        1
1        2
2        2
3        1
4        3
      ...
342    226
343    272
344    273
345    274
346    275
Name: artist_id, Length: 347, dtype: int64>

In [17]:
df2.dtypes

album_id      int64
title        object
artist_id     int64
dtype: object

In [90]:
#check for null values
print(df2.isnull().sum())

album_id     0
title        0
artist_id    0
dtype: int64

In [85]:
#check for duplicate values
print(df2.duplicated().sum())

0

In [18]:
df3 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\artist.csv")
df3.head()

   artist_id               name
0          1              AC/DC
1          2             Accept
2          3          Aerosmith
3          4  Alanis Morissette
4          5    Alice In Chains

In [19]:
df3.shape

(275, 2)

In [20]:
df3.describe()

        artist_id
count  275.000000
mean   138.000000
std     79.529869
min      1.000000
25%     69.500000
50%    138.000000
75%    206.500000
max    275.000000

In [21]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 275 entries, 0 to 274
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   artist_id  275 non-null    int64
 1   name       275 non-null    object
dtypes: int64(1), object(1)
memory usage: 4.4+ KB

In [22]:
df3.columns

Index(['artist_id', 'name'], dtype='object')

In [23]:
df3.dtypes

artist_id     int64
name         object
dtype: object

In [92]:
#check for null values
print(df3.isnull().sum())

artist_id    0
name         0
dtype: int64

In [93]:
#check for duplicate values
print(df3.duplicated().sum())

0

In [24]:
df4 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\customer.csv")
df4.head()

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,NaN,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,+49 0711 2842222,NaN,leonekohler@surfeu.de,5
2,3,François,Tremblay,NaN,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,NaN,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,NaN,Ullevålsveien 14,Oslo,NaN,Norway,171,+47 22 44 22 22,NaN,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,NaN,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [25]:
df4.shape

(59, 13)

In [26]:
df4.describe()

       customer_id  support_rep_id
count    59.000000       59.000000
mean     30.000000        3.949153
std      17.175564        0.818403
min       1.000000        3.000000
25%      15.500000        3.000000
50%      30.000000        4.000000
75%      44.500000        5.000000
max      59.000000        5.000000

In [27]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     59 non-null     int64
 1   first_name      59 non-null     object
 2   last_name       59 non-null     object
 3   company         10 non-null     object
 4   address         59 non-null     object
 5   city            59 non-null     object
 6   state           30 non-null     object
 7   country         59 non-null     object
 8   postal_code     55 non-null     object
 9   phone           58 non-null     object
 10  fax             12 non-null     object
 11  email           59 non-null     object
 12  support_rep_id  59 non-null     int64
dtypes: int64(2), object(11)
memory usage: 6.1+ KB

In [28]:
df4.columns

Index(['customer_id', 'first_name', 'last_name', 'company', 'address', 'city',
       'state', 'country', 'postal_code', 'phone', 'fax', 'email',
       'support_rep_id'],
      dtype='object')

In [125]:
df4['company'].unique()

array(['Embraer - Empresa Brasileira de Aeronáutica S.A.', nan,
       'JetBrains s.r.o.', 'Woodstock Discos', 'Banco do Brasil S.A.',
       'Riotur', 'Telus', 'Rogers Canada', 'Google Inc.',
       'Microsoft Corporation', 'Apple Inc.'], dtype=object)

In [124]:
df4['city'].unique()

array(['São José dos Campos', 'Stuttgart', 'Montréal', 'Oslo', 'Prague',
       'Vienne', 'Brussels', 'Copenhagen', 'São Paulo', 'Rio de Janeiro',
       'Brasília', 'Edmonton', 'Vancouver', 'Mountain View', 'Redmond',
       'New York', 'Cupertino', 'Reno', 'Orlando', 'Boston', 'Chicago',
       'Madison', 'Fort Worth', 'Tucson', 'Salt Lake City', 'Toronto',
       'Ottawa', 'Halifax', 'Winnipeg', 'Yellowknife', 'Lisbon', 'Porto',
       'Berlin', 'Frankfurt', 'Paris', 'Lyon', 'Bordeaux', 'Dijon',
       'Helsinki', 'Budapest', 'Dublin', 'Rome', 'Amsterdam', 'Warsaw',
       'Madrid', 'Stockholm', 'London', 'Edinburgh ', 'Sidney',
       'Buenos Aires', 'Santiago', 'Delhi', 'Bangalore'], dtype=object)

In [123]:
df4['state'].unique()

array(['SP', nan, 'QC', 'RJ', 'DF', 'AB', 'BC', 'CA', 'WA', 'NY', 'NV',
       'FL', 'MA', 'IL', 'WI', 'TX', 'AZ', 'UT', 'ON', 'NS', 'MB', 'NT',
       'Dublin', 'RM', 'VV', 'NSW'], dtype=object)

In [122]:
df4['country'].unique()

array(['Brazil', 'Germany', 'Canada', 'Norway', 'Czech Republic',
       'Austria', 'Belgium', 'Denmark', 'USA', 'Portugal', 'France',
       'Finland', 'Hungary', 'Ireland', 'Italy', 'Netherlands', 'Poland',
       'Spain', 'Sweden', 'United Kingdom', 'Australia', 'Argentina',
       'Chile', 'India'], dtype=object)

In [29]:
df4.dtypes

customer_id        int64
first_name        object
last_name         object
company           object
address           object
city              object
state             object
country           object
postal_code       object
phone             object
fax               object
email             object
support_rep_id     int64
dtype: object

In [94]:
#check for null values
print(df4.isnull().sum())

customer_id        0
first_name         0
last_name          0
company           49
address            0
city               0
state             29
country            0
postal_code        4
phone              1
fax               47
email              0
support_rep_id     0
dtype: int64

In [95]:
#check for duplicate values
print(df4.duplicated().sum())

0

In [30]:
df5 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\employee.csv")
df5.head()

,employee_id,last_name,first_name,title,reports_to,levels,birthdate,hire_date,address,city,state,country,postal_code,phone,fax,email
0,1,Adams,Andrew,General Manager,9.0,L6,18-02-1962 00:00,14-08-2016 00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,L4,08-12-1958 00:00,01-05-2016 00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,L1,29-08-1973 00:00,01-04-2017 00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,L1,19-09-1947 00:00,03-05-2017 00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,L1,03-03-1965 00:00,17-10-2017 00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [31]:
df5.shape

(9, 16)

In [32]:
df5.describe()

       employee_id  reports_to
count     9.000000    8.000000
mean      5.000000    3.625000
std       2.738613    2.973094
min       1.000000    1.000000
25%       3.000000    1.750000
50%       5.000000    2.000000
75%       7.000000    6.000000
max       9.000000    9.000000

In [33]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  9 non-null      int64
 1   last_name    9 non-null      object
 2   first_name   9 non-null      object
 3   title        9 non-null      object
 4   reports_to   8 non-null      float64
 5   levels       9 non-null      object
 6   birthdate    9 non-null      object
 7   hire_date    9 non-null      object
 8   address      9 non-null      object
 9   city         9 non-null      object
 10  state        9 non-null      object
 11  country      9 non-null      object
 12  postal_code  9 non-null      object
 13  phone        9 non-null      object
 14  fax          9 non-null      object
 15  email        9 non-null      object
dtypes: float64(1), int64(1), object(14)
memory usage: 1.3+ KB

In [34]:
df5.columns

Index(['employee_id', 'last_name', 'first_name', 'title', 'reports_to',
       'levels', 'birthdate', 'hire_date', 'address', 'city', 'state',
       'country', 'postal_code', 'phone', 'fax', 'email'],
      dtype='object')

In [127]:
df5['title'].unique()

array(['General Manager', 'Sales Manager', 'Sales Support Agent',
       'IT Manager', 'IT Staff', 'Senior General Manager'], dtype=object)

In [35]:
df5.dtypes

employee_id      int64
last_name       object
first_name      object
title           object
reports_to     float64
levels          object
birthdate       object
hire_date       object
address         object
city            object
state           object
country         object
postal_code     object
phone           object
fax             object
email           object
dtype: object

In [96]:
#check for null values
print(df5.isnull().sum())

employee_id    0
last_name      0
first_name     0
title          0
reports_to     1
levels         0
birthdate      0
hire_date      0
address        0
city           0
state          0
country        0
postal_code    0
phone          0
fax            0
email          0
dtype: int64

In [97]:
#check for duplicate values
print(df5.duplicated().sum())

0

In [36]:
df6 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\genre.csv")
df6.head()

   genre_id                name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll

In [37]:
df6.shape

(25, 2)

In [38]:
df6.describe()

        genre_id
count  25.000000
mean   13.000000
std     7.359801
min     1.000000
25%     7.000000
50%    13.000000
75%    19.000000
max    25.000000

In [39]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   genre_id  25 non-null     int64
 1   name      25 non-null     object
dtypes: int64(1), object(1)
memory usage: 532.0+ bytes

In [40]:
df6.columns

Index(['genre_id', 'name'], dtype='object')

In [41]:
df6.dtypes

genre_id     int64
name        object
dtype: object

In [98]:
#check for null values
print(df6.isnull().sum())

genre_id    0
name        0
dtype: int64

In [99]:
#check for duplicate values
print(df6.duplicated().sum())

0

In [42]:
df7 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\invoice.csv")
df7.head()

,invoice_id,customer_id,invoice_date,billing_address,billing_city,billing_state,billing_country,billing_postal_code,total
0,1,18,2017-01-03 00:00:00,627 Broadway,New York,NY,USA,10012-2612,15.84
1,2,30,2017-01-03 00:00:00,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,9.90
2,3,40,2017-01-05 00:00:00,"8, Rue Hanovre",Paris,NaN,France,75002,1.98
3,4,18,2017-01-06 00:00:00,627 Broadway,New York,NY,USA,10012-2612,7.92
4,5,27,2017-01-07 00:00:00,1033 N Park Ave,Tucson,AZ,USA,85719,16.83

In [43]:
df7.shape

(614, 9)

In [44]:
df7.describe()

       invoice_id  customer_id       total
count  614.000000   614.000000  614.000000
mean   307.500000    29.517915    7.670081
std    177.390811    17.095991    4.218043
min      1.000000     1.000000    0.990000
25%    154.250000    14.000000    3.960000
50%    307.500000    30.000000    7.920000
75%    460.750000    44.000000    9.900000
max    614.000000    59.000000   23.760000

In [45]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   invoice_id           614 non-null    int64
 1   customer_id          614 non-null    int64
 2   invoice_date         614 non-null    object
 3   billing_address      614 non-null    object
 4   billing_city         614 non-null    object
 5   billing_state        310 non-null    object
 6   billing_country      614 non-null    object
 7   billing_postal_code  559 non-null    object
 8   total                614 non-null    float64
dtypes: float64(1), int64(2), object(6)
memory usage: 43.3+ KB

In [46]:
df7.columns

Index(['invoice_id', 'customer_id', 'invoice_date', 'billing_address',
       'billing_city', 'billing_state', 'billing_country',
       'billing_postal_code', 'total'],
      dtype='object')

In [128]:
df7['billing_city'].unique()

array(['New York', 'Ottawa', 'Paris', 'Tucson', 'Halifax', 'Warsaw',
       'Bangalore', 'Berlin', 'Bordeaux', 'Porto', 'Madison', 'Helsinki',
       'São José dos Campos', 'Mountain View', 'Chicago', 'São Paulo',
       'Dijon', 'Copenhagen', 'London', 'Oslo', 'Sidney',
       'Rio de Janeiro', 'Budapest', 'Dublin', 'Montréal', 'Delhi',
       'Yellowknife', 'Lisbon', 'Stockholm', 'Frankfurt', 'Madrid',
       'Cupertino', 'Orlando', 'Reno', 'Santiago', 'Fort Worth',
       'Vancouver', 'Rome', 'Stuttgart', 'Brasília', 'Prague',
       'Amsterdam', 'Winnipeg', 'Brussels', 'Redmond', 'Edinburgh ',
       'Salt Lake City', 'Toronto', 'Vienne', 'Edmonton', 'Boston',
       'Lyon', 'Buenos Aires'], dtype=object)

In [129]:
df7['billing_state'].unique()

array(['NY', 'ON', nan, 'AZ', 'NS', 'WI', 'SP', 'CA', 'IL', 'NSW', 'RJ',
       'Dublin', 'QC', 'NT', 'FL', 'NV', 'TX', 'BC', 'RM', 'DF', 'VV',
       'MB', 'WA', 'UT', 'AB', 'MA'], dtype=object)

In [130]:
df7['billing_country'].unique()

array(['USA', 'Canada', 'France', 'Poland', 'India', 'Germany',
       'Portugal', 'Finland', 'Brazil', 'Denmark', 'United Kingdom',
       'Norway', 'Australia', 'Hungary', 'Ireland', 'Sweden', 'Spain',
       'Chile', 'Italy', 'Czech Republic', 'Netherlands', 'Belgium',
       'Austria', 'Argentina'], dtype=object)

In [47]:
df7.dtypes

invoice_id               int64
customer_id              int64
invoice_date            object
billing_address         object
billing_city            object
billing_state           object
billing_country         object
billing_postal_code     object
total                  float64
dtype: object

In [100]:
#check for null values
print(df7.isnull().sum())

invoice_id               0
customer_id              0
invoice_date             0
billing_address          0
billing_city             0
billing_state          304
billing_country          0
billing_postal_code     55
total                    0
dtype: int64

In [101]:
#check for duplicate values
print(df7.duplicated().sum())

0

In [48]:
df8 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\invoice_line.csv")
df8.head()

   invoice_line_id  invoice_id  track_id  unit_price  quantity
0                1           1      1158        0.99         1
1                2           1      1159        0.99         1
2                3           1      1160        0.99         1
3                4           1      1161        0.99         1
4                5           1      1162        0.99         1

In [49]:
df8.shape

(4757, 5)

In [50]:
df8.describe()

       invoice_line_id   invoice_id     track_id    unit_price  quantity
count      4757.000000  4757.000000  4757.000000  4.757000e+03    4757.0
mean       2379.000000   305.878915  1764.157452  9.900000e-01       1.0
std        1373.371945   177.748265  1004.400012  1.110340e-16       0.0
min           1.000000     1.000000     1.000000  9.900000e-01       1.0
25%        1190.000000   151.000000  1036.000000  9.900000e-01       1.0
50%        2379.000000   306.000000  1850.000000  9.900000e-01       1.0
75%        3568.000000   460.000000  2562.000000  9.900000e-01       1.0
max        4757.000000   614.000000  3500.000000  9.900000e-01       1.0

In [51]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4757 entries, 0 to 4756
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   invoice_line_id  4757 non-null   int64
 1   invoice_id       4757 non-null   int64
 2   track_id         4757 non-null   int64
 3   unit_price       4757 non-null   float64
 4   quantity         4757 non-null   int64
dtypes: float64(1), int64(4)
memory usage: 185.9 KB

In [52]:
df8.columns

Index(['invoice_line_id', 'invoice_id', 'track_id', 'unit_price', 'quantity'], dtype='object')

In [131]:
df8['unit_price'].unique()

array([0.99])

In [53]:
df8.dtypes

invoice_line_id      int64
invoice_id           int64
track_id             int64
unit_price         float64
quantity             int64
dtype: object

In [102]:
#check for null values
print(df8.isnull().sum())

invoice_line_id    0
invoice_id         0
track_id           0
unit_price         0
quantity           0
dtype: int64

In [103]:
#check for duplicate values
print(df8.duplicated().sum())

0

In [54]:
df9 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\media_type.csv")
df9.head()

   media_type_id                         name
0              1              MPEG audio file
1              2     Protected AAC audio file
2              3  Protected MPEG-4 video file
3              4     Purchased AAC audio file
4              5               AAC audio file

In [55]:
df9.shape

(5, 2)

In [56]:
df9.describe()

       media_type_id
count       5.000000
mean        3.000000
std         1.581139
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         5.000000

In [57]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   media_type_id  5 non-null      int64
 1   name           5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [58]:
df9.columns

Index(['media_type_id', 'name'], dtype='object')

In [59]:
df9.dtypes

media_type_id     int64
name             object
dtype: object

In [104]:
#check for null values
print(df9.isnull().sum())

media_type_id    0
name             0
dtype: int64

In [105]:
#check for duplicate values
print(df9.duplicated().sum())

0

In [60]:
df10 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\playlist.csv")
df10.head()

   playlist_id        name
0            1       Music
1            2      Movies
2            3    TV Shows
3            4  Audiobooks
4            5  90’s Music

In [61]:
df10.shape

(18, 2)

In [62]:
df10.describe()

       playlist_id
count    18.000000
mean      9.500000
std       5.338539
min       1.000000
25%       5.250000
50%       9.500000
75%      13.750000
max      18.000000

In [63]:
df10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   playlist_id  18 non-null     int64
 1   name         18 non-null     object
dtypes: int64(1), object(1)
memory usage: 420.0+ bytes

In [64]:
df10.columns

Index(['playlist_id', 'name'], dtype='object')

In [65]:
df10.dtypes

playlist_id     int64
name           object
dtype: object

In [106]:
#check for null values
print(df10.isnull().sum())

playlist_id    0
name           0
dtype: int64

In [107]:
#check for duplicate values
print(df10.duplicated().sum())

0

In [66]:
df11 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\playlist.csv")
df11.head()

   playlist_id        name
0            1       Music
1            2      Movies
2            3    TV Shows
3            4  Audiobooks
4            5  90’s Music

In [67]:
df11.shape

(18, 2)

In [68]:
df11.describe()

       playlist_id
count    18.000000
mean      9.500000
std       5.338539
min       1.000000
25%       5.250000
50%       9.500000
75%      13.750000
max      18.000000

In [69]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   playlist_id  18 non-null     int64
 1   name         18 non-null     object
dtypes: int64(1), object(1)
memory usage: 420.0+ bytes

In [70]:
df11.columns

Index(['playlist_id', 'name'], dtype='object')

In [71]:
df11.dtypes

playlist_id     int64
name           object
dtype: object

In [108]:
#check for null values
print(df11.isnull().sum())

playlist_id    0
name           0
dtype: int64

In [109]:
#check for duplicate values
print(df11.duplicated().sum())

0

In [72]:
df12 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\playlist_track.csv")
df12.head()

   playlist_id  track_id
0            1      3402
1            1      3389
2            1      3390
3            1      3391
4            1      3392

In [73]:
df12.shape

(8715, 2)

In [74]:
df12.describe()

       playlist_id     track_id
count  8715.000000  8715.000000
mean      4.917040  1767.081698
std       3.476453  1023.669286
min       1.000000     1.000000
25%       1.000000   888.000000
50%       5.000000  1773.000000
75%       8.000000  2652.000000
max      18.000000  3503.000000

In [75]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8715 entries, 0 to 8714
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   playlist_id  8715 non-null   int64
 1   track_id     8715 non-null   int64
dtypes: int64(2)
memory usage: 136.3 KB

In [76]:
df12.columns

Index(['playlist_id', 'track_id'], dtype='object')

In [77]:
df12.dtypes

playlist_id    int64
track_id       int64
dtype: object

In [110]:
#check for null values
print(df12.isnull().sum())

playlist_id    0
track_id       0
dtype: int64

In [111]:
#check for duplicate values
print(df12.duplicated().sum())

0

In [78]:
df13 = pd.read_csv(r"C:\Users\ROHAN VERMA R11\Desktop\music store data\track.csv")
df13.head()

,track_id,name,album_id,media_type_id,genre_id,composer,milliseconds,bytes,unit_price
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,NaN,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [79]:
df13.shape

(3503, 9)

In [80]:
df13.describe()

,track_id,album_id,media_type_id,genre_id,milliseconds,bytes,unit_price
count,3503.000000,3503.000000,3503.000000,3503.000000,3.503000e+03,3.503000e+03,3503.000000
mean,1752.000000,140.929489,1.208393,5.725378,3.935992e+05,3.351021e+07,1.050805
std,1011.373324,81.775395,0.580443,6.190204,5.350054e+05,1.053925e+08,0.239006
min,1.000000,1.000000,1.000000,1.000000,1.071000e+03,3.874700e+04,0.990000
25%,876.500000,70.500000,1.000000,1.000000,2.072810e+05,6.342566e+06,0.990000
50%,1752.000000,141.000000,1.000000,3.000000,2.556340e+05,8.107896e+06,0.990000
75%,2627.500000,212.000000,1.000000,7.000000,3.216450e+05,1.026679e+07,0.990000
max,3503.000000,347.000000,5.000000,25.000000,5.286953e+06,1.059546e+09,1.990000

In [81]:
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3503 entries, 0 to 3502
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   track_id       3503 non-null   int64
 1   name           3503 non-null   object
 2   album_id       3503 non-null   int64
 3   media_type_id  3503 non-null   int64
 4   genre_id       3503 non-null   int64
 5   composer       2525 non-null   object
 6   milliseconds   3503 non-null   int64
 7   bytes          3503 non-null   int64
 8   unit_price     3503 non-null   float64
dtypes: float64(1), int64(6), object(2)
memory usage: 246.4+ KB

In [82]:
df13.columns

Index(['track_id', 'name', 'album_id', 'media_type_id', 'genre_id', 'composer',
       'milliseconds', 'bytes', 'unit_price'],
      dtype='object')

In [132]:
df13['media_type_id'].unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [133]:
df13['genre_id'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25], dtype=int64)

In [134]:
df13['unit_price'].unique()

array([0.99, 1.99])

In [83]:
df13.dtypes

track_id           int64
name              object
album_id           int64
media_type_id      int64
genre_id           int64
composer          object
milliseconds       int64
bytes              int64
unit_price       float64
dtype: object

In [112]:
#check for null values
print(df13.isnull().sum())

track_id           0
name               0
album_id           0
media_type_id      0
genre_id           0
composer         978
milliseconds       0
bytes              0
unit_price         0
dtype: int64

In [113]:
#check for duplicate values
print(df13.duplicated().sum())

0